---
kind: method
id: M:Autodesk.Revit.DB.Structure.TrussMemberInfo.#ctor
source: html/f2e3b1c8-1598-f213-03da-f13034760fb5.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberInfo.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public TrussMemberInfo()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never
be created by the developer.